Cases/container/container_testing/constant/airOutside/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

air
{
    type        transparent;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0 0);
        emissivity      (1 1);
    }
}
// inlet
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }
// outlet
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }

airOutside_to_ground
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.4 0.4);
        emissivity      (0.4 0.4);
    };
}

// trailer
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.9 0.9);
//         emissivity      (0.9 0.9);
//     };
// }

// lkw
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.9 0.9);
//         emissivity      (0.9 0.9);
//     };
// }

airOutside_to_carrier
{
type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.2 0.2);
        emissivity      (0.2 0.2);
    };
}

// ************************************************************************* //
