Cases/container/container_testing/constant/airOutside/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeViewFactorMatrix     true;
writeFacesAgglomeration   true;
writePatchViewFactors     true;
dumpRays    true;

// maxDynListLength     10000000;

air
{
nFacesInCoarsestLevel 48;
// featureAngle 10;
}

airOutside_to_carrier
{
nFacesInCoarsestLevel 48;
// featureAngle 10;
}

airOutside_to_ground
{
nFacesInCoarsestLevel 48;
// featureAngle 10;
}

// ************************************************************************* //
